In [7]:
import pandas as pd
from sklearn.impute import SimpleImputer
import numpy as np

In [8]:
df=pd.read_csv("Data.csv")

In [9]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [11]:
imputer=SimpleImputer(missing_values=np.nan,strategy='most_frequent')
imputer.fit(df.iloc[:,1:3].values)
df.iloc[:,1:3]=imputer.transform(df.iloc[:,1:3].values)

In [12]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0       Yes
1    Spain  27.0  48000.0       Yes
2      NaN  30.0  54000.0       NaN
3    Spain  38.0  61000.0        No
4  Germany  40.0  48000.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  27.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [13]:
df.iloc[:,1:2]

    Age
0  44.0
1  27.0
2  30.0
3  38.0
4  40.0
5  35.0
6  27.0
7  48.0
8  50.0
9  37.0

In [16]:
imputer=SimpleImputer(missing_values=np.nan,strategy='most_frequent')
imputer.fit(df)
df=imputer.transform(df)

In [17]:
df

array([['France', 44.0, 72000.0, 'Yes'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['France', 30.0, 54000.0, 'Yes'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, 48000.0, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', 27.0, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)